DATA SERIES

In [1]:
import pandas as pd
import numpy as np

data = np.array([1,2,3,4])
series = pd.Series(data)
series

0    1
1    2
2    3
3    4
dtype: int64

DATA FRAME

In [2]:
data = np.array([1,2,3,4])
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4

In [5]:
data = np.array(["apple","orange","banana","grape","mango"])
series = pd.Series(data)
series

0     apple
1    orange
2    banana
3     grape
4     mango
dtype: object

In [4]:
data = np.array(["apple","orange","banana","grape","mango"])

df = pd.DataFrame(data)
df

        0
0   apple
1  orange
2  banana
3   grape
4   mango

SERIES CREATING, INDEXING, SELECTING

In [7]:
data = ["senin", "selasa", "rabu", "kamis"]
data_dict = {
    "satu" : "senin",
    "dua" : "selasa",
    "tiga" : "Rabu",
    "empat" : "kamis"
}
series1 = pd.Series(data)
series2 = pd.Series(data, index = [1,2,3,4])
series3 = pd.Series(data_dict)
print(series1)
print(series2)
print(series3)

0     senin
1    selasa
2      rabu
3     kamis
dtype: object
1     senin
2    selasa
3      rabu
4     kamis
dtype: object
satu      senin
dua      selasa
tiga       Rabu
empat     kamis
dtype: object

In [9]:
series1

0     senin
1    selasa
2      rabu
3     kamis
dtype: object

In [10]:
print(series[0])
print(series[1])
print(series[0:3])

apple
orange
0     apple
1    orange
2    banana
dtype: object

In [11]:
series3

satu      senin
dua      selasa
tiga       Rabu
empat     kamis
dtype: object

In [12]:
series3.loc["satu" : "tiga"]

satu     senin
dua     selasa
tiga      Rabu
dtype: object

In [13]:
series.iloc[0:3]

0     apple
1    orange
2    banana
dtype: object

In [14]:
data = {
    1 : "Januari",
    2 : "Februari",
    3 : "Maret",
    4 : "April",
    5 : "Mei",
    6 : "Juni",
    7 : "Juli",
    8 : "Agustus",
    9 : "September",
    10 : "Oktober",
    11 : "Nomvember",
    12 : "Desember"
}
series1 = pd.Series(data)

1       Januari
2      Februari
3         Maret
4         April
5           Mei
6          Juni
7          Juli
8       Agustus
9     September
10      Oktober
11    Nomvember
12     Desember
dtype: object

In [15]:
series1.loc[1 : 12]

1       Januari
2      Februari
3         Maret
4         April
5           Mei
6          Juni
7          Juli
8       Agustus
9     September
10      Oktober
11    Nomvember
12     Desember
dtype: object

In [16]:
series1.iloc[0:]

1       Januari
2      Februari
3         Maret
4         April
5           Mei
6          Juni
7          Juli
8       Agustus
9     September
10      Oktober
11    Nomvember
12     Desember
dtype: object

In [17]:
series1.values

array(['Januari', 'Februari', 'Maret', 'April', 'Mei', 'Juni', 'Juli',
       'Agustus', 'September', 'Oktober', 'Nomvember', 'Desember'],
      dtype=object)

SERIES SELECTION

In [18]:
data = [2000, 500, 1500, 3000, 4000]
series = pd.Series(data)
series

0    2000
1     500
2    1500
3    3000
4    4000
dtype: int64

In [19]:
series > 2000

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [21]:
series[series>2000]

3    3000
4    4000
dtype: int64

In [22]:
series[(series>1500)&(series < 4000)]

0    2000
3    3000
dtype: int64

In [23]:
data1 = [1000,1000,1000,1000,1000]
series1 = pd.Series(data1)

hasil = series1 + series + 9000
hasil

0    12000
1    10500
2    11500
3    13000
4    14000
dtype: int64

In [24]:
series_str = series.astype(str)
series_str

0    2000
1     500
2    1500
3    3000
4    4000
dtype: object

In [25]:
series[0] = 10000
series

0    10000
1      500
2     1500
3     3000
4     4000
dtype: int64

In [26]:
print(series.mean())

3800.0

ASSIGNMENT

In [27]:
data = {
    "Januari" : 408,
    "Februari" : 943,
    "Maret" : 902,
    "April" : 117,
    "Mei" : 389,
    "Juni" : 435,
    "Juli" : 793,
    "Agustus" : 356,
    "September" : 651,
    "Oktober" : 993,
    "November" : 786,
    "Desember" : 157
}
tugas1 = pd.Series(data)
print(tugas1)

Januari      408
Februari     943
Maret        902
April        117
Mei          389
Juni         435
Juli         793
Agustus      356
September    651
Oktober      993
November     786
Desember     157
dtype: int64

In [28]:
tugas1.mean()

np.float64(577.5)

In [29]:
tugas1[tugas1>tugas1.mean()]

Februari     943
Maret        902
Juli         793
September    651
Oktober      993
November     786
dtype: int64

In [30]:
tugas1[tugas1>tugas1.mean()] = tugas1.mean()
tugas1

C:\Users\AsusVivoBook\AppData\Local\Temp\ipykernel_29628\168438786.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '577.5' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  tugas1[tugas1>tugas1.mean()] = tugas1.mean()

Januari      408.0
Februari     577.5
Maret        577.5
April        117.0
Mei          389.0
Juni         435.0
Juli         577.5
Agustus      356.0
September    577.5
Oktober      577.5
November     577.5
Desember     157.0
dtype: float64